Revit 2024 API
IndexLine.Index0 Property
 The index of the line segment's first vertex.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public int Index0 { get; set; }
Visual Basic
Public Property Index0 As Integer
	Get
	Set
Visual C++
public:
property int Index0 {
	int get ();
	void set (int value);
}
See Also
IndexLine Class
Autodesk.Revit.DB.DirectContext3D Namespace